SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_crc.h
/**************************************************************************//**
 * @file
 * @brief EFR32FG25 CRC register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32FG25_CRC_H
#define EFR32FG25_CRC_H
#define CRC_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32FG25_CRC CRC
 * @{
 * @brief EFR32FG25 CRC Register Declaration.
 *****************************************************************************/

/** CRC Register Declaration. */
typedef struct {
  __IM uint32_t  IPVERSION;                     /**< IP Version ID                                      */
  __IOM uint32_t EN;                            /**< Module Enable                                      */
  __IOM uint32_t SWRST;                         /**< Software Reset                                     */
  __IOM uint32_t CONNECT;                       /**< New Register                                       */
  __IOM uint32_t DISCLK;                        /**< Disable Clocks                                     */
  uint32_t       RESERVED0[3U];                 /**< Reserved for future use                            */
  __IOM uint32_t FIFOIN;                        /**< New Register                                       */
  uint32_t       RESERVED1[7U];                 /**< Reserved for future use                            */
  __IM uint32_t  FIFOOUT;                       /**< New Register                                       */
  uint32_t       RESERVED2[23U];                /**< Reserved for future use                            */
  __IOM uint32_t FMTIN;                         /**< New Register                                       */
  uint32_t       RESERVED3[7U];                 /**< Reserved for future use                            */
  uint32_t       RESERVED4[1U];                 /**< Reserved for future use                            */
  uint32_t       RESERVED5[79U];                /**< Reserved for future use                            */
  __IOM uint32_t CTRL1;                         /**< New Register                                       */
  __IOM uint32_t CTRL2;                         /**< New Register                                       */
  __IOM uint32_t POLY;                          /**< New Register                                       */
  __IOM uint32_t INIT;                          /**< New Register                                       */
  uint32_t       RESERVED6[5U];                 /**< Reserved for future use                            */
  __IM uint32_t  STATUS;                        /**< New Register                                       */
  __IM uint32_t  REFERENCE;                     /**< New Register                                       */
  __IM uint32_t  RECEIVED;                      /**< New Register                                       */
  __IOM uint32_t IF;                            /**< Interrupt Flag                                     */
  __IOM uint32_t IEN;                           /**< Interrupt Enable                                   */
  __IOM uint32_t CTRL3;                         /**< New Register                                       */
  uint32_t       RESERVED7[881U];               /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_SET;                 /**< IP Version ID                                      */
  __IOM uint32_t EN_SET;                        /**< Module Enable                                      */
  __IOM uint32_t SWRST_SET;                     /**< Software Reset                                     */
  __IOM uint32_t CONNECT_SET;                   /**< New Register                                       */
  __IOM uint32_t DISCLK_SET;                    /**< Disable Clocks                                     */
  uint32_t       RESERVED8[3U];                 /**< Reserved for future use                            */
  __IOM uint32_t FIFOIN_SET;                    /**< New Register                                       */
  uint32_t       RESERVED9[7U];                 /**< Reserved for future use                            */
  __IM uint32_t  FIFOOUT_SET;                   /**< New Register                                       */
  uint32_t       RESERVED10[23U];               /**< Reserved for future use                            */
  __IOM uint32_t FMTIN_SET;                     /**< New Register                                       */
  uint32_t       RESERVED11[7U];                /**< Reserved for future use                            */
  uint32_t       RESERVED12[1U];                /**< Reserved for future use                            */
  uint32_t       RESERVED13[79U];               /**< Reserved for future use                            */
  __IOM uint32_t CTRL1_SET;                     /**< New Register                                       */
  __IOM uint32_t CTRL2_SET;                     /**< New Register                                       */
  __IOM uint32_t POLY_SET;                      /**< New Register                                       */
  __IOM uint32_t INIT_SET;                      /**< New Register                                       */
  uint32_t       RESERVED14[5U];                /**< Reserved for future use                            */
  __IM uint32_t  STATUS_SET;                    /**< New Register                                       */
  __IM uint32_t  REFERENCE_SET;                 /**< New Register                                       */
  __IM uint32_t  RECEIVED_SET;                  /**< New Register                                       */
  __IOM uint32_t IF_SET;                        /**< Interrupt Flag                                     */
  __IOM uint32_t IEN_SET;                       /**< Interrupt Enable                                   */
  __IOM uint32_t CTRL3_SET;                     /**< New Register                                       */
  uint32_t       RESERVED15[881U];              /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_CLR;                 /**< IP Version ID                                      */
  __IOM uint32_t EN_CLR;                        /**< Module Enable                                      */
  __IOM uint32_t SWRST_CLR;                     /**< Software Reset                                     */
  __IOM uint32_t CONNECT_CLR;                   /**< New Register                                       */
  __IOM uint32_t DISCLK_CLR;                    /**< Disable Clocks                                     */
  uint32_t       RESERVED16[3U];                /**< Reserved for future use                            */
  __IOM uint32_t FIFOIN_CLR;                    /**< New Register                                       */
  uint32_t       RESERVED17[7U];                /**< Reserved for future use                            */
  __IM uint32_t  FIFOOUT_CLR;                   /**< New Register                                       */
  uint32_t       RESERVED18[23U];               /**< Reserved for future use                            */
  __IOM uint32_t FMTIN_CLR;                     /**< New Register                                       */
  uint32_t       RESERVED19[7U];                /**< Reserved for future use                            */
  uint32_t       RESERVED20[1U];                /**< Reserved for future use                            */
  uint32_t       RESERVED21[79U];               /**< Reserved for future use                            */
  __IOM uint32_t CTRL1_CLR;                     /**< New Register                                       */
  __IOM uint32_t CTRL2_CLR;                     /**< New Register                                       */
  __IOM uint32_t POLY_CLR;                      /**< New Register                                       */
  __IOM uint32_t INIT_CLR;                      /**< New Register                                       */
  uint32_t       RESERVED22[5U];                /**< Reserved for future use                            */
  __IM uint32_t  STATUS_CLR;                    /**< New Register                                       */
  __IM uint32_t  REFERENCE_CLR;                 /**< New Register                                       */
  __IM uint32_t  RECEIVED_CLR;                  /**< New Register                                       */
  __IOM uint32_t IF_CLR;                        /**< Interrupt Flag                                     */
  __IOM uint32_t IEN_CLR;                       /**< Interrupt Enable                                   */
  __IOM uint32_t CTRL3_CLR;                     /**< New Register                                       */
  uint32_t       RESERVED23[881U];              /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_TGL;                 /**< IP Version ID                                      */
  __IOM uint32_t EN_TGL;                        /**< Module Enable                                      */
  __IOM uint32_t SWRST_TGL;                     /**< Software Reset                                     */
  __IOM uint32_t CONNECT_TGL;                   /**< New Register                                       */
  __IOM uint32_t DISCLK_TGL;                    /**< Disable Clocks                                     */
  uint32_t       RESERVED24[3U];                /**< Reserved for future use                            */
  __IOM uint32_t FIFOIN_TGL;                    /**< New Register                                       */
  uint32_t       RESERVED25[7U];                /**< Reserved for future use                            */
  __IM uint32_t  FIFOOUT_TGL;                   /**< New Register                                       */
  uint32_t       RESERVED26[23U];               /**< Reserved for future use                            */
  __IOM uint32_t FMTIN_TGL;                     /**< New Register                                       */
  uint32_t       RESERVED27[7U];                /**< Reserved for future use                            */
  uint32_t       RESERVED28[1U];                /**< Reserved for future use                            */
  uint32_t       RESERVED29[79U];               /**< Reserved for future use                            */
  __IOM uint32_t CTRL1_TGL;                     /**< New Register                                       */
  __IOM uint32_t CTRL2_TGL;                     /**< New Register                                       */
  __IOM uint32_t POLY_TGL;                      /**< New Register                                       */
  __IOM uint32_t INIT_TGL;                      /**< New Register                                       */
  uint32_t       RESERVED30[5U];                /**< Reserved for future use                            */
  __IM uint32_t  STATUS_TGL;                    /**< New Register                                       */
  __IM uint32_t  REFERENCE_TGL;                 /**< New Register                                       */
  __IM uint32_t  RECEIVED_TGL;                  /**< New Register                                       */
  __IOM uint32_t IF_TGL;                        /**< Interrupt Flag                                     */
  __IOM uint32_t IEN_TGL;                       /**< Interrupt Enable                                   */
  __IOM uint32_t CTRL3_TGL;                     /**< New Register                                       */
} CRC_TypeDef;
/** @} End of group EFR32FG25_CRC */

/**************************************************************************//**
 * @addtogroup EFR32FG25_CRC
 * @{
 * @defgroup EFR32FG25_CRC_BitFields CRC Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for CRC IPVERSION */
#define _CRC_IPVERSION_RESETVALUE           0x00000001UL                                /**< Default value for CRC_IPVERSION             */
#define _CRC_IPVERSION_MASK                 0xFFFFFFFFUL                                /**< Mask for CRC_IPVERSION                      */
#define _CRC_IPVERSION_IPVERSION_SHIFT      0                                           /**< Shift value for CRC_IPVERSION               */
#define _CRC_IPVERSION_IPVERSION_MASK       0xFFFFFFFFUL                                /**< Bit mask for CRC_IPVERSION                  */
#define _CRC_IPVERSION_IPVERSION_DEFAULT    0x00000001UL                                /**< Mode DEFAULT for CRC_IPVERSION              */
#define CRC_IPVERSION_IPVERSION_DEFAULT     (_CRC_IPVERSION_IPVERSION_DEFAULT << 0)     /**< Shifted mode DEFAULT for CRC_IPVERSION      */

/* Bit fields for CRC EN */
#define _CRC_EN_RESETVALUE                  0x00000000UL                                /**< Default value for CRC_EN                    */
#define _CRC_EN_MASK                        0x00000003UL                                /**< Mask for CRC_EN                             */
#define CRC_EN_EN                           (0x1UL << 0)                                /**< Module Enable                               */
#define _CRC_EN_EN_SHIFT                    0                                           /**< Shift value for CRC_EN                      */
#define _CRC_EN_EN_MASK                     0x1UL                                       /**< Bit mask for CRC_EN                         */
#define _CRC_EN_EN_DEFAULT                  0x00000000UL                                /**< Mode DEFAULT for CRC_EN                     */
#define CRC_EN_EN_DEFAULT                   (_CRC_EN_EN_DEFAULT << 0)                   /**< Shifted mode DEFAULT for CRC_EN             */
#define CRC_EN_DISABLING                    (0x1UL << 1)                                /**< Disablement Busy Status                     */
#define _CRC_EN_DISABLING_SHIFT             1                                           /**< Shift value for CRC_DISABLING               */
#define _CRC_EN_DISABLING_MASK              0x2UL                                       /**< Bit mask for CRC_DISABLING                  */
#define _CRC_EN_DISABLING_DEFAULT           0x00000000UL                                /**< Mode DEFAULT for CRC_EN                     */
#define CRC_EN_DISABLING_DEFAULT            (_CRC_EN_DISABLING_DEFAULT << 1)            /**< Shifted mode DEFAULT for CRC_EN             */

/* Bit fields for CRC SWRST */
#define _CRC_SWRST_RESETVALUE               0x00000000UL                                /**< Default value for CRC_SWRST                 */
#define _CRC_SWRST_MASK                     0x00000003UL                                /**< Mask for CRC_SWRST                          */
#define CRC_SWRST_SWRST                     (0x1UL << 0)                                /**< Software Reset Command                      */
#define _CRC_SWRST_SWRST_SHIFT              0                                           /**< Shift value for CRC_SWRST                   */
#define _CRC_SWRST_SWRST_MASK               0x1UL                                       /**< Bit mask for CRC_SWRST                      */
#define _CRC_SWRST_SWRST_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for CRC_SWRST                  */
#define CRC_SWRST_SWRST_DEFAULT             (_CRC_SWRST_SWRST_DEFAULT << 0)             /**< Shifted mode DEFAULT for CRC_SWRST          */
#define CRC_SWRST_RESETTING                 (0x1UL << 1)                                /**< Software Reset Busy Status                  */
#define _CRC_SWRST_RESETTING_SHIFT          1                                           /**< Shift value for CRC_RESETTING               */
#define _CRC_SWRST_RESETTING_MASK           0x2UL                                       /**< Bit mask for CRC_RESETTING                  */
#define _CRC_SWRST_RESETTING_DEFAULT        0x00000000UL                                /**< Mode DEFAULT for CRC_SWRST                  */
#define CRC_SWRST_RESETTING_DEFAULT         (_CRC_SWRST_RESETTING_DEFAULT << 1)         /**< Shifted mode DEFAULT for CRC_SWRST          */

/* Bit fields for CRC CONNECT */
#define _CRC_CONNECT_RESETVALUE             0x00000000UL                                /**< Default value for CRC_CONNECT               */
#define _CRC_CONNECT_MASK                   0x00000101UL                                /**< Mask for CRC_CONNECT                        */
#define CRC_CONNECT_IN                      (0x1UL << 0)                                /**< Input FIFO connect                          */
#define _CRC_CONNECT_IN_SHIFT               0                                           /**< Shift value for CRC_IN                      */
#define _CRC_CONNECT_IN_MASK                0x1UL                                       /**< Bit mask for CRC_IN                         */
#define _CRC_CONNECT_IN_DEFAULT             0x00000000UL                                /**< Mode DEFAULT for CRC_CONNECT                */
#define CRC_CONNECT_IN_DEFAULT              (_CRC_CONNECT_IN_DEFAULT << 0)              /**< Shifted mode DEFAULT for CRC_CONNECT        */
#define CRC_CONNECT_OUT                     (0x1UL << 8)                                /**< Output FIFO connect                         */
#define _CRC_CONNECT_OUT_SHIFT              8                                           /**< Shift value for CRC_OUT                     */
#define _CRC_CONNECT_OUT_MASK               0x100UL                                     /**< Bit mask for CRC_OUT                        */
#define _CRC_CONNECT_OUT_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for CRC_CONNECT                */
#define CRC_CONNECT_OUT_DEFAULT             (_CRC_CONNECT_OUT_DEFAULT << 8)             /**< Shifted mode DEFAULT for CRC_CONNECT        */

/* Bit fields for CRC DISCLK */
#define _CRC_DISCLK_RESETVALUE              0x00000002UL                                /**< Default value for CRC_DISCLK                */
#define _CRC_DISCLK_MASK                    0x00000003UL                                /**< Mask for CRC_DISCLK                         */
#define _CRC_DISCLK_DISCLK_SHIFT            0                                           /**< Shift value for CRC_DISCLK                  */
#define _CRC_DISCLK_DISCLK_MASK             0x3UL                                       /**< Bit mask for CRC_DISCLK                     */
#define _CRC_DISCLK_DISCLK_DEFAULT          0x00000002UL                                /**< Mode DEFAULT for CRC_DISCLK                 */
#define _CRC_DISCLK_DISCLK_NONE             0x00000000UL                                /**< Mode NONE for CRC_DISCLK                    */
#define _CRC_DISCLK_DISCLK_ALL              0x00000001UL                                /**< Mode ALL for CRC_DISCLK                     */
#define _CRC_DISCLK_DISCLK_AUTO             0x00000002UL                                /**< Mode AUTO for CRC_DISCLK                    */
#define _CRC_DISCLK_DISCLK_NOTUSED          0x00000003UL                                /**< Mode NOTUSED for CRC_DISCLK                 */
#define CRC_DISCLK_DISCLK_DEFAULT           (_CRC_DISCLK_DISCLK_DEFAULT << 0)           /**< Shifted mode DEFAULT for CRC_DISCLK         */
#define CRC_DISCLK_DISCLK_NONE              (_CRC_DISCLK_DISCLK_NONE << 0)              /**< Shifted mode NONE for CRC_DISCLK            */
#define CRC_DISCLK_DISCLK_ALL               (_CRC_DISCLK_DISCLK_ALL << 0)               /**< Shifted mode ALL for CRC_DISCLK             */
#define CRC_DISCLK_DISCLK_AUTO              (_CRC_DISCLK_DISCLK_AUTO << 0)              /**< Shifted mode AUTO for CRC_DISCLK            */
#define CRC_DISCLK_DISCLK_NOTUSED           (_CRC_DISCLK_DISCLK_NOTUSED << 0)           /**< Shifted mode NOTUSED for CRC_DISCLK         */

