SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_crc.h
/* Bit fields for CRC FIFOIN */
#define _CRC_FIFOIN_RESETVALUE              0x00000000UL                                /**< Default value for CRC_FIFOIN                */
#define _CRC_FIFOIN_MASK                    0x1FFF3F0FUL                                /**< Mask for CRC_FIFOIN                         */
#define _CRC_FIFOIN_FID_SHIFT               0                                           /**< Shift value for CRC_FID                     */
#define _CRC_FIFOIN_FID_MASK                0xFUL                                       /**< Bit mask for CRC_FID                        */
#define _CRC_FIFOIN_FID_DEFAULT             0x00000000UL                                /**< Mode DEFAULT for CRC_FIFOIN                 */
#define CRC_FIFOIN_FID_DEFAULT              (_CRC_FIFOIN_FID_DEFAULT << 0)              /**< Shifted mode DEFAULT for CRC_FIFOIN         */
#define _CRC_FIFOIN_CID_SHIFT               8                                           /**< Shift value for CRC_CID                     */
#define _CRC_FIFOIN_CID_MASK                0x3F00UL                                    /**< Bit mask for CRC_CID                        */
#define _CRC_FIFOIN_CID_DEFAULT             0x00000000UL                                /**< Mode DEFAULT for CRC_FIFOIN                 */
#define CRC_FIFOIN_CID_DEFAULT              (_CRC_FIFOIN_CID_DEFAULT << 8)              /**< Shifted mode DEFAULT for CRC_FIFOIN         */
#define _CRC_FIFOIN_REM_SHIFT               16                                          /**< Shift value for CRC_REM                     */
#define _CRC_FIFOIN_REM_MASK                0xFF0000UL                                  /**< Bit mask for CRC_REM                        */
#define _CRC_FIFOIN_REM_DEFAULT             0x00000000UL                                /**< Mode DEFAULT for CRC_FIFOIN                 */
#define CRC_FIFOIN_REM_DEFAULT              (_CRC_FIFOIN_REM_DEFAULT << 16)             /**< Shifted mode DEFAULT for CRC_FIFOIN         */
#define _CRC_FIFOIN_ALARM_SHIFT             24                                          /**< Shift value for CRC_ALARM                   */
#define _CRC_FIFOIN_ALARM_MASK              0x1F000000UL                                /**< Bit mask for CRC_ALARM                      */
#define _CRC_FIFOIN_ALARM_DEFAULT           0x00000000UL                                /**< Mode DEFAULT for CRC_FIFOIN                 */
#define CRC_FIFOIN_ALARM_DEFAULT            (_CRC_FIFOIN_ALARM_DEFAULT << 24)           /**< Shifted mode DEFAULT for CRC_FIFOIN         */

/* Bit fields for CRC FIFOOUT */
#define _CRC_FIFOOUT_RESETVALUE             0x00000000UL                                /**< Default value for CRC_FIFOOUT               */
#define _CRC_FIFOOUT_MASK                   0x1FFF0000UL                                /**< Mask for CRC_FIFOOUT                        */
#define _CRC_FIFOOUT_CNT_SHIFT              16                                          /**< Shift value for CRC_CNT                     */
#define _CRC_FIFOOUT_CNT_MASK               0xFF0000UL                                  /**< Bit mask for CRC_CNT                        */
#define _CRC_FIFOOUT_CNT_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for CRC_FIFOOUT                */
#define CRC_FIFOOUT_CNT_DEFAULT             (_CRC_FIFOOUT_CNT_DEFAULT << 16)            /**< Shifted mode DEFAULT for CRC_FIFOOUT        */
#define _CRC_FIFOOUT_ALARM_SHIFT            24                                          /**< Shift value for CRC_ALARM                   */
#define _CRC_FIFOOUT_ALARM_MASK             0x1F000000UL                                /**< Bit mask for CRC_ALARM                      */
#define _CRC_FIFOOUT_ALARM_DEFAULT          0x00000000UL                                /**< Mode DEFAULT for CRC_FIFOOUT                */
#define CRC_FIFOOUT_ALARM_DEFAULT           (_CRC_FIFOOUT_ALARM_DEFAULT << 24)          /**< Shifted mode DEFAULT for CRC_FIFOOUT        */

/* Bit fields for CRC FMTIN */
#define _CRC_FMTIN_RESETVALUE               0x0000001FUL                                /**< Default value for CRC_FMTIN                 */
#define _CRC_FMTIN_MASK                     0x0003031FUL                                /**< Mask for CRC_FMTIN                          */
#define _CRC_FMTIN_ELEMSIZE_SHIFT           0                                           /**< Shift value for CRC_ELEMSIZE                */
#define _CRC_FMTIN_ELEMSIZE_MASK            0x1FUL                                      /**< Bit mask for CRC_ELEMSIZE                   */
#define _CRC_FMTIN_ELEMSIZE_DEFAULT         0x0000001FUL                                /**< Mode DEFAULT for CRC_FMTIN                  */
#define CRC_FMTIN_ELEMSIZE_DEFAULT          (_CRC_FMTIN_ELEMSIZE_DEFAULT << 0)          /**< Shifted mode DEFAULT for CRC_FMTIN          */
#define _CRC_FMTIN_ELEMNB_SHIFT             8                                           /**< Shift value for CRC_ELEMNB                  */
#define _CRC_FMTIN_ELEMNB_MASK              0x300UL                                     /**< Bit mask for CRC_ELEMNB                     */
#define _CRC_FMTIN_ELEMNB_DEFAULT           0x00000000UL                                /**< Mode DEFAULT for CRC_FMTIN                  */
#define _CRC_FMTIN_ELEMNB_ONE               0x00000000UL                                /**< Mode ONE for CRC_FMTIN                      */
#define _CRC_FMTIN_ELEMNB_TWO               0x00000001UL                                /**< Mode TWO for CRC_FMTIN                      */
#define _CRC_FMTIN_ELEMNB_FOUR              0x00000002UL                                /**< Mode FOUR for CRC_FMTIN                     */
#define CRC_FMTIN_ELEMNB_DEFAULT            (_CRC_FMTIN_ELEMNB_DEFAULT << 8)            /**< Shifted mode DEFAULT for CRC_FMTIN          */
#define CRC_FMTIN_ELEMNB_ONE                (_CRC_FMTIN_ELEMNB_ONE << 8)                /**< Shifted mode ONE for CRC_FMTIN              */
#define CRC_FMTIN_ELEMNB_TWO                (_CRC_FMTIN_ELEMNB_TWO << 8)                /**< Shifted mode TWO for CRC_FMTIN              */
#define CRC_FMTIN_ELEMNB_FOUR               (_CRC_FMTIN_ELEMNB_FOUR << 8)               /**< Shifted mode FOUR for CRC_FMTIN             */
#define _CRC_FMTIN_ELEMALIGN_SHIFT          16                                          /**< Shift value for CRC_ELEMALIGN               */
#define _CRC_FMTIN_ELEMALIGN_MASK           0x30000UL                                   /**< Bit mask for CRC_ELEMALIGN                  */
#define _CRC_FMTIN_ELEMALIGN_DEFAULT        0x00000000UL                                /**< Mode DEFAULT for CRC_FMTIN                  */
#define _CRC_FMTIN_ELEMALIGN_WORD           0x00000000UL                                /**< Mode WORD for CRC_FMTIN                     */
#define _CRC_FMTIN_ELEMALIGN_HALFWORD       0x00000001UL                                /**< Mode HALFWORD for CRC_FMTIN                 */
#define _CRC_FMTIN_ELEMALIGN_BYTE           0x00000002UL                                /**< Mode BYTE for CRC_FMTIN                     */
#define CRC_FMTIN_ELEMALIGN_DEFAULT         (_CRC_FMTIN_ELEMALIGN_DEFAULT << 16)        /**< Shifted mode DEFAULT for CRC_FMTIN          */
#define CRC_FMTIN_ELEMALIGN_WORD            (_CRC_FMTIN_ELEMALIGN_WORD << 16)           /**< Shifted mode WORD for CRC_FMTIN             */
#define CRC_FMTIN_ELEMALIGN_HALFWORD        (_CRC_FMTIN_ELEMALIGN_HALFWORD << 16)       /**< Shifted mode HALFWORD for CRC_FMTIN         */
#define CRC_FMTIN_ELEMALIGN_BYTE            (_CRC_FMTIN_ELEMALIGN_BYTE << 16)           /**< Shifted mode BYTE for CRC_FMTIN             */

/* Bit fields for CRC CTRL1 */
#define _CRC_CTRL1_RESETVALUE               0x00000000UL                                /**< Default value for CRC_CTRL1                 */
#define _CRC_CTRL1_MASK                     0x8000C1FFUL                                /**< Mask for CRC_CTRL1                          */
#define CRC_CTRL1_RST                       (0x1UL << 0)                                /**< New BitField                                */
#define _CRC_CTRL1_RST_SHIFT                0                                           /**< Shift value for CRC_RST                     */
#define _CRC_CTRL1_RST_MASK                 0x1UL                                       /**< Bit mask for CRC_RST                        */
#define _CRC_CTRL1_RST_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for CRC_CTRL1                  */
#define _CRC_CTRL1_RST_RUN                  0x00000000UL                                /**< Mode RUN for CRC_CTRL1                      */
#define _CRC_CTRL1_RST_RESET                0x00000001UL                                /**< Mode RESET for CRC_CTRL1                    */
#define CRC_CTRL1_RST_DEFAULT               (_CRC_CTRL1_RST_DEFAULT << 0)               /**< Shifted mode DEFAULT for CRC_CTRL1          */
#define CRC_CTRL1_RST_RUN                   (_CRC_CTRL1_RST_RUN << 0)                   /**< Shifted mode RUN for CRC_CTRL1              */
#define CRC_CTRL1_RST_RESET                 (_CRC_CTRL1_RST_RESET << 0)                 /**< Shifted mode RESET for CRC_CTRL1            */
#define CRC_CTRL1_ENREQOUT                  (0x1UL << 1)                                /**< New BitField                                */
#define _CRC_CTRL1_ENREQOUT_SHIFT           1                                           /**< Shift value for CRC_ENREQOUT                */
#define _CRC_CTRL1_ENREQOUT_MASK            0x2UL                                       /**< Bit mask for CRC_ENREQOUT                   */
#define _CRC_CTRL1_ENREQOUT_DEFAULT         0x00000000UL                                /**< Mode DEFAULT for CRC_CTRL1                  */
#define _CRC_CTRL1_ENREQOUT_NO              0x00000000UL                                /**< Mode NO for CRC_CTRL1                       */
#define _CRC_CTRL1_ENREQOUT_YES             0x00000001UL                                /**< Mode YES for CRC_CTRL1                      */
#define CRC_CTRL1_ENREQOUT_DEFAULT          (_CRC_CTRL1_ENREQOUT_DEFAULT << 1)          /**< Shifted mode DEFAULT for CRC_CTRL1          */
#define CRC_CTRL1_ENREQOUT_NO               (_CRC_CTRL1_ENREQOUT_NO << 1)               /**< Shifted mode NO for CRC_CTRL1               */
#define CRC_CTRL1_ENREQOUT_YES              (_CRC_CTRL1_ENREQOUT_YES << 1)              /**< Shifted mode YES for CRC_CTRL1              */
#define CRC_CTRL1_INV                       (0x1UL << 2)                                /**< New BitField                                */
#define _CRC_CTRL1_INV_SHIFT                2                                           /**< Shift value for CRC_INV                     */
#define _CRC_CTRL1_INV_MASK                 0x4UL                                       /**< Bit mask for CRC_INV                        */
#define _CRC_CTRL1_INV_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for CRC_CTRL1                  */
#define _CRC_CTRL1_INV_NO                   0x00000000UL                                /**< Mode NO for CRC_CTRL1                       */
#define _CRC_CTRL1_INV_YES                  0x00000001UL                                /**< Mode YES for CRC_CTRL1                      */
#define CRC_CTRL1_INV_DEFAULT               (_CRC_CTRL1_INV_DEFAULT << 2)               /**< Shifted mode DEFAULT for CRC_CTRL1          */
#define CRC_CTRL1_INV_NO                    (_CRC_CTRL1_INV_NO << 2)                    /**< Shifted mode NO for CRC_CTRL1               */
#define CRC_CTRL1_INV_YES                   (_CRC_CTRL1_INV_YES << 2)                   /**< Shifted mode YES for CRC_CTRL1              */
#define CRC_CTRL1_SWAPIN                    (0x1UL << 3)                                /**< New BitField                                */
#define _CRC_CTRL1_SWAPIN_SHIFT             3                                           /**< Shift value for CRC_SWAPIN                  */
#define _CRC_CTRL1_SWAPIN_MASK              0x8UL                                       /**< Bit mask for CRC_SWAPIN                     */
#define _CRC_CTRL1_SWAPIN_DEFAULT           0x00000000UL                                /**< Mode DEFAULT for CRC_CTRL1                  */
#define _CRC_CTRL1_SWAPIN_NO                0x00000000UL                                /**< Mode NO for CRC_CTRL1                       */
#define _CRC_CTRL1_SWAPIN_YES               0x00000001UL                                /**< Mode YES for CRC_CTRL1                      */
#define CRC_CTRL1_SWAPIN_DEFAULT            (_CRC_CTRL1_SWAPIN_DEFAULT << 3)            /**< Shifted mode DEFAULT for CRC_CTRL1          */
#define CRC_CTRL1_SWAPIN_NO                 (_CRC_CTRL1_SWAPIN_NO << 3)                 /**< Shifted mode NO for CRC_CTRL1               */
#define CRC_CTRL1_SWAPIN_YES                (_CRC_CTRL1_SWAPIN_YES << 3)                /**< Shifted mode YES for CRC_CTRL1              */
#define CRC_CTRL1_SYNCSTAT                  (0x1UL << 4)                                /**< New BitField                                */
#define _CRC_CTRL1_SYNCSTAT_SHIFT           4                                           /**< Shift value for CRC_SYNCSTAT                */
#define _CRC_CTRL1_SYNCSTAT_MASK            0x10UL                                      /**< Bit mask for CRC_SYNCSTAT                   */
#define _CRC_CTRL1_SYNCSTAT_DEFAULT         0x00000000UL                                /**< Mode DEFAULT for CRC_CTRL1                  */
#define _CRC_CTRL1_SYNCSTAT_NO              0x00000000UL                                /**< Mode NO for CRC_CTRL1                       */
#define _CRC_CTRL1_SYNCSTAT_YES             0x00000001UL                                /**< Mode YES for CRC_CTRL1                      */
#define CRC_CTRL1_SYNCSTAT_DEFAULT          (_CRC_CTRL1_SYNCSTAT_DEFAULT << 4)          /**< Shifted mode DEFAULT for CRC_CTRL1          */
#define CRC_CTRL1_SYNCSTAT_NO               (_CRC_CTRL1_SYNCSTAT_NO << 4)               /**< Shifted mode NO for CRC_CTRL1               */
#define CRC_CTRL1_SYNCSTAT_YES              (_CRC_CTRL1_SYNCSTAT_YES << 4)              /**< Shifted mode YES for CRC_CTRL1              */
#define CRC_CTRL1_SWAPOUT                   (0x1UL << 5)                                /**< New BitField                                */
#define _CRC_CTRL1_SWAPOUT_SHIFT            5                                           /**< Shift value for CRC_SWAPOUT                 */
#define _CRC_CTRL1_SWAPOUT_MASK             0x20UL                                      /**< Bit mask for CRC_SWAPOUT                    */
#define _CRC_CTRL1_SWAPOUT_DEFAULT          0x00000000UL                                /**< Mode DEFAULT for CRC_CTRL1                  */
#define _CRC_CTRL1_SWAPOUT_NO               0x00000000UL                                /**< Mode NO for CRC_CTRL1                       */
#define _CRC_CTRL1_SWAPOUT_YES              0x00000001UL                                /**< Mode YES for CRC_CTRL1                      */
#define CRC_CTRL1_SWAPOUT_DEFAULT           (_CRC_CTRL1_SWAPOUT_DEFAULT << 5)           /**< Shifted mode DEFAULT for CRC_CTRL1          */
#define CRC_CTRL1_SWAPOUT_NO                (_CRC_CTRL1_SWAPOUT_NO << 5)                /**< Shifted mode NO for CRC_CTRL1               */
#define CRC_CTRL1_SWAPOUT_YES               (_CRC_CTRL1_SWAPOUT_YES << 5)               /**< Shifted mode YES for CRC_CTRL1              */
#define CRC_CTRL1_BYPASS                    (0x1UL << 6)                                /**< New BitField                                */
#define _CRC_CTRL1_BYPASS_SHIFT             6                                           /**< Shift value for CRC_BYPASS                  */
#define _CRC_CTRL1_BYPASS_MASK              0x40UL                                      /**< Bit mask for CRC_BYPASS                     */
#define _CRC_CTRL1_BYPASS_DEFAULT           0x00000000UL                                /**< Mode DEFAULT for CRC_CTRL1                  */
#define _CRC_CTRL1_BYPASS_NO                0x00000000UL                                /**< Mode NO for CRC_CTRL1                       */
#define _CRC_CTRL1_BYPASS_YES               0x00000001UL                                /**< Mode YES for CRC_CTRL1                      */
#define CRC_CTRL1_BYPASS_DEFAULT            (_CRC_CTRL1_BYPASS_DEFAULT << 6)            /**< Shifted mode DEFAULT for CRC_CTRL1          */
#define CRC_CTRL1_BYPASS_NO                 (_CRC_CTRL1_BYPASS_NO << 6)                 /**< Shifted mode NO for CRC_CTRL1               */
#define CRC_CTRL1_BYPASS_YES                (_CRC_CTRL1_BYPASS_YES << 6)                /**< Shifted mode YES for CRC_CTRL1              */
#define CRC_CTRL1_OUTMODE                   (0x1UL << 7)                                /**< New BitField                                */
#define _CRC_CTRL1_OUTMODE_SHIFT            7                                           /**< Shift value for CRC_OUTMODE                 */
#define _CRC_CTRL1_OUTMODE_MASK             0x80UL                                      /**< Bit mask for CRC_OUTMODE                    */
#define _CRC_CTRL1_OUTMODE_DEFAULT          0x00000000UL                                /**< Mode DEFAULT for CRC_CTRL1                  */
#define _CRC_CTRL1_OUTMODE_ALL              0x00000000UL                                /**< Mode ALL for CRC_CTRL1                      */
#define _CRC_CTRL1_OUTMODE_ONLY_CRC         0x00000001UL                                /**< Mode ONLY_CRC for CRC_CTRL1                 */
#define CRC_CTRL1_OUTMODE_DEFAULT           (_CRC_CTRL1_OUTMODE_DEFAULT << 7)           /**< Shifted mode DEFAULT for CRC_CTRL1          */
#define CRC_CTRL1_OUTMODE_ALL               (_CRC_CTRL1_OUTMODE_ALL << 7)               /**< Shifted mode ALL for CRC_CTRL1              */
#define CRC_CTRL1_OUTMODE_ONLY_CRC          (_CRC_CTRL1_OUTMODE_ONLY_CRC << 7)          /**< Shifted mode ONLY_CRC for CRC_CTRL1         */
#define CRC_CTRL1_INVIN                     (0x1UL << 8)                                /**< New BitField                                */
#define _CRC_CTRL1_INVIN_SHIFT              8                                           /**< Shift value for CRC_INVIN                   */
#define _CRC_CTRL1_INVIN_MASK               0x100UL                                     /**< Bit mask for CRC_INVIN                      */
#define _CRC_CTRL1_INVIN_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for CRC_CTRL1                  */
#define _CRC_CTRL1_INVIN_NO                 0x00000000UL                                /**< Mode NO for CRC_CTRL1                       */
#define _CRC_CTRL1_INVIN_YES                0x00000001UL                                /**< Mode YES for CRC_CTRL1                      */
#define CRC_CTRL1_INVIN_DEFAULT             (_CRC_CTRL1_INVIN_DEFAULT << 8)             /**< Shifted mode DEFAULT for CRC_CTRL1          */
#define CRC_CTRL1_INVIN_NO                  (_CRC_CTRL1_INVIN_NO << 8)                  /**< Shifted mode NO for CRC_CTRL1               */
#define CRC_CTRL1_INVIN_YES                 (_CRC_CTRL1_INVIN_YES << 8)                 /**< Shifted mode YES for CRC_CTRL1              */
#define CRC_CTRL1_ENCODE                    (0x1UL << 14)                               /**< New BitField                                */
#define _CRC_CTRL1_ENCODE_SHIFT             14                                          /**< Shift value for CRC_ENCODE                  */
#define _CRC_CTRL1_ENCODE_MASK              0x4000UL                                    /**< Bit mask for CRC_ENCODE                     */
#define _CRC_CTRL1_ENCODE_DEFAULT           0x00000000UL                                /**< Mode DEFAULT for CRC_CTRL1                  */
#define _CRC_CTRL1_ENCODE_NO                0x00000000UL                                /**< Mode NO for CRC_CTRL1                       */
#define _CRC_CTRL1_ENCODE_YES               0x00000001UL                                /**< Mode YES for CRC_CTRL1                      */
#define CRC_CTRL1_ENCODE_DEFAULT            (_CRC_CTRL1_ENCODE_DEFAULT << 14)           /**< Shifted mode DEFAULT for CRC_CTRL1          */
#define CRC_CTRL1_ENCODE_NO                 (_CRC_CTRL1_ENCODE_NO << 14)                /**< Shifted mode NO for CRC_CTRL1               */
#define CRC_CTRL1_ENCODE_YES                (_CRC_CTRL1_ENCODE_YES << 14)               /**< Shifted mode YES for CRC_CTRL1              */
#define CRC_CTRL1_GENIT                     (0x1UL << 15)                               /**< New BitField                                */
#define _CRC_CTRL1_GENIT_SHIFT              15                                          /**< Shift value for CRC_GENIT                   */
#define _CRC_CTRL1_GENIT_MASK               0x8000UL                                    /**< Bit mask for CRC_GENIT                      */
#define _CRC_CTRL1_GENIT_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for CRC_CTRL1                  */
#define _CRC_CTRL1_GENIT_NO                 0x00000000UL                                /**< Mode NO for CRC_CTRL1                       */
#define _CRC_CTRL1_GENIT_YES                0x00000001UL                                /**< Mode YES for CRC_CTRL1                      */
#define CRC_CTRL1_GENIT_DEFAULT             (_CRC_CTRL1_GENIT_DEFAULT << 15)            /**< Shifted mode DEFAULT for CRC_CTRL1          */
#define CRC_CTRL1_GENIT_NO                  (_CRC_CTRL1_GENIT_NO << 15)                 /**< Shifted mode NO for CRC_CTRL1               */
#define CRC_CTRL1_GENIT_YES                 (_CRC_CTRL1_GENIT_YES << 15)                /**< Shifted mode YES for CRC_CTRL1              */
#define CRC_CTRL1_DEBUG                     (0x1UL << 31)                               /**< New BitField                                */
#define _CRC_CTRL1_DEBUG_SHIFT              31                                          /**< Shift value for CRC_DEBUG                   */
#define _CRC_CTRL1_DEBUG_MASK               0x80000000UL                                /**< Bit mask for CRC_DEBUG                      */
#define _CRC_CTRL1_DEBUG_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for CRC_CTRL1                  */
#define _CRC_CTRL1_DEBUG_NO                 0x00000000UL                                /**< Mode NO for CRC_CTRL1                       */
#define _CRC_CTRL1_DEBUG_YES                0x00000001UL                                /**< Mode YES for CRC_CTRL1                      */
#define CRC_CTRL1_DEBUG_DEFAULT             (_CRC_CTRL1_DEBUG_DEFAULT << 31)            /**< Shifted mode DEFAULT for CRC_CTRL1          */
#define CRC_CTRL1_DEBUG_NO                  (_CRC_CTRL1_DEBUG_NO << 31)                 /**< Shifted mode NO for CRC_CTRL1               */
#define CRC_CTRL1_DEBUG_YES                 (_CRC_CTRL1_DEBUG_YES << 31)                /**< Shifted mode YES for CRC_CTRL1              */

