SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_crc.h
/* Bit fields for CRC CTRL2 */
#define _CRC_CTRL2_RESETVALUE               0x00000000UL                                /**< Default value for CRC_CTRL2                 */
#define _CRC_CTRL2_MASK                     0x007FFFFFUL                                /**< Mask for CRC_CTRL2                          */
#define _CRC_CTRL2_LENGTH_SHIFT             0                                           /**< Shift value for CRC_LENGTH                  */
#define _CRC_CTRL2_LENGTH_MASK              0x7FUL                                      /**< Bit mask for CRC_LENGTH                     */
#define _CRC_CTRL2_LENGTH_DEFAULT           0x00000000UL                                /**< Mode DEFAULT for CRC_CTRL2                  */
#define _CRC_CTRL2_LENGTH_CRC8              0x00000008UL                                /**< Mode CRC8 for CRC_CTRL2                     */
#define _CRC_CTRL2_LENGTH_CRC16             0x00000010UL                                /**< Mode CRC16 for CRC_CTRL2                    */
#define _CRC_CTRL2_LENGTH_CRC32             0x00000020UL                                /**< Mode CRC32 for CRC_CTRL2                    */
#define CRC_CTRL2_LENGTH_DEFAULT            (_CRC_CTRL2_LENGTH_DEFAULT << 0)            /**< Shifted mode DEFAULT for CRC_CTRL2          */
#define CRC_CTRL2_LENGTH_CRC8               (_CRC_CTRL2_LENGTH_CRC8 << 0)               /**< Shifted mode CRC8 for CRC_CTRL2             */
#define CRC_CTRL2_LENGTH_CRC16              (_CRC_CTRL2_LENGTH_CRC16 << 0)              /**< Shifted mode CRC16 for CRC_CTRL2            */
#define CRC_CTRL2_LENGTH_CRC32              (_CRC_CTRL2_LENGTH_CRC32 << 0)              /**< Shifted mode CRC32 for CRC_CTRL2            */
#define _CRC_CTRL2_NBBITS_SHIFT             7                                           /**< Shift value for CRC_NBBITS                  */
#define _CRC_CTRL2_NBBITS_MASK              0x7FFF80UL                                  /**< Bit mask for CRC_NBBITS                     */
#define _CRC_CTRL2_NBBITS_DEFAULT           0x00000000UL                                /**< Mode DEFAULT for CRC_CTRL2                  */
#define CRC_CTRL2_NBBITS_DEFAULT            (_CRC_CTRL2_NBBITS_DEFAULT << 7)            /**< Shifted mode DEFAULT for CRC_CTRL2          */

/* Bit fields for CRC POLY */
#define _CRC_POLY_RESETVALUE                0x000000E0UL                                /**< Default value for CRC_POLY                  */
#define _CRC_POLY_MASK                      0xFFFFFFFFUL                                /**< Mask for CRC_POLY                           */
#define _CRC_POLY_POLY_SHIFT                0                                           /**< Shift value for CRC_POLY                    */
#define _CRC_POLY_POLY_MASK                 0xFFFFFFFFUL                                /**< Bit mask for CRC_POLY                       */
#define _CRC_POLY_POLY_DEFAULT              0x000000E0UL                                /**< Mode DEFAULT for CRC_POLY                   */
#define CRC_POLY_POLY_DEFAULT               (_CRC_POLY_POLY_DEFAULT << 0)               /**< Shifted mode DEFAULT for CRC_POLY           */

/* Bit fields for CRC INIT */
#define _CRC_INIT_RESETVALUE                0x00000000UL                                /**< Default value for CRC_INIT                  */
#define _CRC_INIT_MASK                      0xFFFFFFFFUL                                /**< Mask for CRC_INIT                           */
#define _CRC_INIT_INIT_SHIFT                0                                           /**< Shift value for CRC_INIT                    */
#define _CRC_INIT_INIT_MASK                 0xFFFFFFFFUL                                /**< Bit mask for CRC_INIT                       */
#define _CRC_INIT_INIT_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for CRC_INIT                   */
#define CRC_INIT_INIT_DEFAULT               (_CRC_INIT_INIT_DEFAULT << 0)               /**< Shifted mode DEFAULT for CRC_INIT           */

/* Bit fields for CRC STATUS */
#define _CRC_STATUS_RESETVALUE              0x00000000UL                                /**< Default value for CRC_STATUS                */
#define _CRC_STATUS_MASK                    0x00000003UL                                /**< Mask for CRC_STATUS                         */
#define CRC_STATUS_STATE                    (0x1UL << 0)                                /**< New BitField                                */
#define _CRC_STATUS_STATE_SHIFT             0                                           /**< Shift value for CRC_STATE                   */
#define _CRC_STATUS_STATE_MASK              0x1UL                                       /**< Bit mask for CRC_STATE                      */
#define _CRC_STATUS_STATE_DEFAULT           0x00000000UL                                /**< Mode DEFAULT for CRC_STATUS                 */
#define _CRC_STATUS_STATE_Computing         0x00000000UL                                /**< Mode Computing for CRC_STATUS               */
#define _CRC_STATUS_STATE_Completed         0x00000001UL                                /**< Mode Completed for CRC_STATUS               */
#define CRC_STATUS_STATE_DEFAULT            (_CRC_STATUS_STATE_DEFAULT << 0)            /**< Shifted mode DEFAULT for CRC_STATUS         */
#define CRC_STATUS_STATE_Computing          (_CRC_STATUS_STATE_Computing << 0)          /**< Shifted mode Computing for CRC_STATUS       */
#define CRC_STATUS_STATE_Completed          (_CRC_STATUS_STATE_Completed << 0)          /**< Shifted mode Completed for CRC_STATUS       */
#define CRC_STATUS_STATUS                   (0x1UL << 1)                                /**< New BitField                                */
#define _CRC_STATUS_STATUS_SHIFT            1                                           /**< Shift value for CRC_STATUS                  */
#define _CRC_STATUS_STATUS_MASK             0x2UL                                       /**< Bit mask for CRC_STATUS                     */
#define _CRC_STATUS_STATUS_DEFAULT          0x00000000UL                                /**< Mode DEFAULT for CRC_STATUS                 */
#define _CRC_STATUS_STATUS_Good             0x00000000UL                                /**< Mode Good for CRC_STATUS                    */
#define _CRC_STATUS_STATUS_Failed           0x00000001UL                                /**< Mode Failed for CRC_STATUS                  */
#define CRC_STATUS_STATUS_DEFAULT           (_CRC_STATUS_STATUS_DEFAULT << 1)           /**< Shifted mode DEFAULT for CRC_STATUS         */
#define CRC_STATUS_STATUS_Good              (_CRC_STATUS_STATUS_Good << 1)              /**< Shifted mode Good for CRC_STATUS            */
#define CRC_STATUS_STATUS_Failed            (_CRC_STATUS_STATUS_Failed << 1)            /**< Shifted mode Failed for CRC_STATUS          */

/* Bit fields for CRC REFERENCE */
#define _CRC_REFERENCE_RESETVALUE           0x00000000UL                                /**< Default value for CRC_REFERENCE             */
#define _CRC_REFERENCE_MASK                 0xFFFFFFFFUL                                /**< Mask for CRC_REFERENCE                      */
#define _CRC_REFERENCE_REFERENCE_SHIFT      0                                           /**< Shift value for CRC_REFERENCE               */
#define _CRC_REFERENCE_REFERENCE_MASK       0xFFFFFFFFUL                                /**< Bit mask for CRC_REFERENCE                  */
#define _CRC_REFERENCE_REFERENCE_DEFAULT    0x00000000UL                                /**< Mode DEFAULT for CRC_REFERENCE              */
#define CRC_REFERENCE_REFERENCE_DEFAULT     (_CRC_REFERENCE_REFERENCE_DEFAULT << 0)     /**< Shifted mode DEFAULT for CRC_REFERENCE      */

