SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_crc.h
/* Bit fields for CRC RECEIVED */
#define _CRC_RECEIVED_RESETVALUE            0x00000000UL                                /**< Default value for CRC_RECEIVED              */
#define _CRC_RECEIVED_MASK                  0xFFFFFFFFUL                                /**< Mask for CRC_RECEIVED                       */
#define _CRC_RECEIVED_RECEIVED_SHIFT        0                                           /**< Shift value for CRC_RECEIVED                */
#define _CRC_RECEIVED_RECEIVED_MASK         0xFFFFFFFFUL                                /**< Bit mask for CRC_RECEIVED                   */
#define _CRC_RECEIVED_RECEIVED_DEFAULT      0x00000000UL                                /**< Mode DEFAULT for CRC_RECEIVED               */
#define CRC_RECEIVED_RECEIVED_DEFAULT       (_CRC_RECEIVED_RECEIVED_DEFAULT << 0)       /**< Shifted mode DEFAULT for CRC_RECEIVED       */

/* Bit fields for CRC IF */
#define _CRC_IF_RESETVALUE                  0x00000000UL                                /**< Default value for CRC_IF                    */
#define _CRC_IF_MASK                        0x00000001UL                                /**< Mask for CRC_IF                             */
#define CRC_IF_DONE                         (0x1UL << 0)                                /**< New BitField                                */
#define _CRC_IF_DONE_SHIFT                  0                                           /**< Shift value for CRC_DONE                    */
#define _CRC_IF_DONE_MASK                   0x1UL                                       /**< Bit mask for CRC_DONE                       */
#define _CRC_IF_DONE_DEFAULT                0x00000000UL                                /**< Mode DEFAULT for CRC_IF                     */
#define CRC_IF_DONE_DEFAULT                 (_CRC_IF_DONE_DEFAULT << 0)                 /**< Shifted mode DEFAULT for CRC_IF             */

/* Bit fields for CRC IEN */
#define _CRC_IEN_RESETVALUE                 0x00000000UL                                /**< Default value for CRC_IEN                   */
#define _CRC_IEN_MASK                       0x00000001UL                                /**< Mask for CRC_IEN                            */
#define CRC_IEN_DONE                        (0x1UL << 0)                                /**< New BitField                                */
#define _CRC_IEN_DONE_SHIFT                 0                                           /**< Shift value for CRC_DONE                    */
#define _CRC_IEN_DONE_MASK                  0x1UL                                       /**< Bit mask for CRC_DONE                       */
#define _CRC_IEN_DONE_DEFAULT               0x00000000UL                                /**< Mode DEFAULT for CRC_IEN                    */
#define CRC_IEN_DONE_DEFAULT                (_CRC_IEN_DONE_DEFAULT << 0)                /**< Shifted mode DEFAULT for CRC_IEN            */

/* Bit fields for CRC CTRL3 */
#define _CRC_CTRL3_RESETVALUE               0x00000001UL                                /**< Default value for CRC_CTRL3                 */
#define _CRC_CTRL3_MASK                     0x00000001UL                                /**< Mask for CRC_CTRL3                          */
#define CRC_CTRL3_PADDING                   (0x1UL << 0)                                /**< New BitField                                */
#define _CRC_CTRL3_PADDING_SHIFT            0                                           /**< Shift value for CRC_PADDING                 */
#define _CRC_CTRL3_PADDING_MASK             0x1UL                                       /**< Bit mask for CRC_PADDING                    */
#define _CRC_CTRL3_PADDING_DEFAULT          0x00000001UL                                /**< Mode DEFAULT for CRC_CTRL3                  */
#define _CRC_CTRL3_PADDING_NO               0x00000000UL                                /**< Mode NO for CRC_CTRL3                       */
#define _CRC_CTRL3_PADDING_YES              0x00000001UL                                /**< Mode YES for CRC_CTRL3                      */
#define CRC_CTRL3_PADDING_DEFAULT           (_CRC_CTRL3_PADDING_DEFAULT << 0)           /**< Shifted mode DEFAULT for CRC_CTRL3          */
#define CRC_CTRL3_PADDING_NO                (_CRC_CTRL3_PADDING_NO << 0)                /**< Shifted mode NO for CRC_CTRL3               */
#define CRC_CTRL3_PADDING_YES               (_CRC_CTRL3_PADDING_YES << 0)               /**< Shifted mode YES for CRC_CTRL3              */

/** @} End of group EFR32FG25_CRC_BitFields */
/** @} End of group EFR32FG25_CRC */
/** @} End of group Parts */

#endif /* EFR32FG25_CRC_H */
